tap "homebrew/bundle"
tap "tidbyt/tidbyt"
brew "arp-scan"
brew "bash-completion"
brew "clang-format"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "imagemagick"
brew "jq"
brew "mosquitto"
brew "nginx"
brew "nmap"
brew "ripgrep"
brew "shellcheck"
brew "tree"
brew "watch"
brew "tidbyt/tidbyt/pixlet"
cask "claude-code"
cask "docker-desktop"
cask "wireshark-app"
vscode "1yib.rust-bundle"
vscode "alefragnani.pascal"
vscode "alefragnani.pascal-formatter"
vscode "alexcvzz.vscode-sqlite"
vscode "anthropic.claude-code"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-mermaid"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "didericis.starlark"
vscode "docker.docker"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "maelvalais.autoconf"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "oouo-diogo-perdigao.docthis"
vscode "redhat.java"
vscode "repreng.csv"
vscode "robocorp.robotframework-lsp"
vscode "runem.lit-plugin"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "code2prompt"
cargo "create-tauri-app"
cargo "tauri-cli"
cargo "wasm-tools"
cargo "wit-bindgen-cli"
