tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "autoconf@2.13"
brew "python"
brew "cairo"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "cppcheck"
brew "exercism"
brew "git"
brew "gnu-tar"
brew "gnupg"
brew "gnuplot"
brew "shared-mime-info"
brew "imagemagick"
brew "lcov"
brew "llvm"
brew "mercurial"
brew "mosquitto"
brew "nmap"
brew "node", link: false
brew "octave"
brew "swig"
brew "telnet"
brew "tree"
brew "watch"
brew "wget"
cask "iterm2"
